In [31]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [32]:
df=DataFrame({'key1':['a','a','b','b','a'],
             'key2':['one','two','one','two','one'],
             'data1':np.random.randn(5),
             'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.061459 -0.883727
1    a  two  0.555506  0.326156
2    b  one -0.284197  0.094715
3    b  two  1.076089 -1.479801
4    a  one -0.874282 -2.125695

In [33]:
grouped=df['data1'].groupby(df['key1'])
grouped

In [34]:
grouped.mean()

key1
a    0.247561
b    0.395946
Name: data1, dtype: float64

In [39]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one     0.093589
      two     0.555506
b     one    -0.284197
      two     1.076089
Name: data1, dtype: float64

In [40]:
means.unstack()

key2       one       two
key1
a     0.093589  0.555506
b    -0.284197  1.076089

In [41]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])
years=np.array([2005,2005,2006,2005,2006])
df['data1'].groupby([states, years]).mean()

California  2005    0.555506
            2006   -0.284197
Ohio        2005    1.068774
            2006   -0.874282
Name: data1, dtype: float64

In [42]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.247561 -0.894422
b     0.395946 -0.692543

In [43]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.093589 -1.504711
     two   0.555506  0.326156
b    one  -0.284197  0.094715
     two   1.076089 -1.479801

In [44]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [46]:
'''
对分组进行迭代
'''
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.061459 -0.883727
1    a  two  0.555506  0.326156
4    a  one -0.874282 -2.125695
b
  key1 key2     data1     data2
2    b  one -0.284197  0.094715
3    b  two  1.076089 -1.479801

In [47]:
for (k1,k2), group in df.groupby(['key1','key2']):
    print(k1,k2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one  1.061459 -0.883727
4    a  one -0.874282 -2.125695
a two
  key1 key2     data1     data2
1    a  two  0.555506  0.326156
b one
  key1 key2     data1     data2
2    b  one -0.284197  0.094715
b two
  key1 key2     data1     data2
3    b  two  1.076089 -1.479801

In [48]:
pieces=dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one -0.284197  0.094715
3    b  two  1.076089 -1.479801

In [50]:
grouped=df.groupby(df.dtypes,axis=1)
dict(list(grouped))

{dtype('float64'):       data1     data2
 0  1.061459 -0.883727
 1  0.555506  0.326156
 2 -0.284197  0.094715
 3  1.076089 -1.479801
 4 -0.874282 -2.125695, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [51]:
'''
选取一个或一组列
'''
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [52]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one  -1.504711
     two   0.326156
b    one   0.094715
     two  -1.479801

In [54]:
s_grouped=df.groupby(['key1','key2'])['data2']
s_grouped.mean()

key1  key2
a     one    -1.504711
      two     0.326156
b     one     0.094715
      two    -1.479801
Name: data2, dtype: float64

In [56]:
'''
通过字典或series进行分组
'''
people = DataFrame(np.random.randn(5,5),
                  columns=['a','b','c','d','e'],
                  index=['Joe','Steve','Wes','Jim','Travis'])
people.loc[2:3,['b','c']] = np.nan
people

               a         b         c         d         e
Joe    -0.435875  0.268018  0.323754 -1.487244 -0.958377
Steve   0.912297 -0.469002  0.911947 -0.285867 -1.569517
Wes    -1.678929       NaN       NaN -1.017416 -0.008560
Jim     0.635656  0.216185  0.406808 -0.020393  0.897972
Travis -0.498887 -0.080906  3.269293  0.840960 -1.438902

In [57]:
mapping = {'a':'red','b':'red','c':'blue',
          'd':'blue','e':'red','f':'orange'}
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe    -1.163490 -1.126234
Steve   0.626079 -1.126222
Wes    -1.017416 -1.687488
Jim     0.386415  1.749813
Travis  4.110253 -2.018694

In [58]:
map_series = Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [59]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [60]:
'''
通过函数进行分组
'''
people.groupby(len).sum()

          a         b         c         d         e
3 -1.479148  0.484203  0.730563 -2.525053 -0.068964
5  0.912297 -0.469002  0.911947 -0.285867 -1.569517
6 -0.498887 -0.080906  3.269293  0.840960 -1.438902

In [61]:
key_list = ['one','one','one','two','two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.678929  0.268018  0.323754 -1.487244 -0.958377
  two  0.635656  0.216185  0.406808 -0.020393  0.897972
5 one  0.912297 -0.469002  0.911947 -0.285867 -1.569517
6 two -0.498887 -0.080906  3.269293  0.840960 -1.438902

In [64]:
'''
数据聚合
'''
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    0.960268
b    0.940060
Name: data1, dtype: float64

In [65]:
def peak_to_peak(arr):
    return arr.max()-arr.min()
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.935741  2.451851
b     1.360286  1.574516

In [66]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.247561  1.003940 -0.874282 -0.159388  0.555506  0.808483
b      2.0  0.395946  0.961867 -0.284197  0.055874  0.395946  0.736017

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.061459   3.0 -0.894422  1.225960 -2.125695 -1.504711 -0.883727
b     1.076089   2.0 -0.692543  1.113351 -1.479801 -1.086172 -0.692543


           75%       max
key1
a    -0.278785  0.326156
b    -0.298914  0.094715

In [68]:
'''
分组级运算和转换
'''
k1_means = df.groupby('key1').mean().add_prefix('mean_')
k1_means

      mean_data1  mean_data2
key1
a       0.247561   -0.894422
b       0.395946   -0.692543

In [70]:
pd.merge(df,k1_means,left_on='key1',right_index=True)

  key1 key2     data1     data2  mean_data1  mean_data2
0    a  one  1.061459 -0.883727    0.247561   -0.894422
1    a  two  0.555506  0.326156    0.247561   -0.894422
4    a  one -0.874282 -2.125695    0.247561   -0.894422
2    b  one -0.284197  0.094715    0.395946   -0.692543
3    b  two  1.076089 -1.479801    0.395946   -0.692543

In [71]:
key=['one','two','one','two','one']
people.groupby(key).mean()

            a         b         c         d         e
one -0.871230  0.093556  1.796524 -0.554567 -0.801946
two  0.773976 -0.126409  0.659378 -0.153130 -0.335772

In [72]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
Joe    -0.871230  0.093556  1.796524 -0.554567 -0.801946
Steve   0.773976 -0.126409  0.659378 -0.153130 -0.335772
Wes    -0.871230  0.093556  1.796524 -0.554567 -0.801946
Jim     0.773976 -0.126409  0.659378 -0.153130 -0.335772
Travis -0.871230  0.093556  1.796524 -0.554567 -0.801946

In [73]:
def demean(arr):
    return arr-arr.mean()
demeaned=people.groupby(key).transform(demean)
demeaned

               a         b         c         d         e
Joe     0.435355  0.174462 -1.472769 -0.932677 -0.156431
Steve   0.138321 -0.342594  0.252569 -0.132737 -1.233745
Wes    -0.807698       NaN       NaN -0.462849  0.793386
Jim    -0.138321  0.342594 -0.252569  0.132737  1.233745
Travis  0.372343 -0.174462  1.472769  1.395527 -0.636956

In [74]:
demeaned.groupby(key).mean()

                a             b             c             d             e
one  1.850372e-17  0.000000e+00 -1.110223e-16 -7.401487e-17  3.700743e-17
two -5.551115e-17 -2.775558e-17  2.775558e-17  1.387779e-17  0.000000e+00

In [79]:
'''
分位数和桶分析
'''
frame=DataFrame({'data1':np.random.randn(1000),
                'data2':np.random.randn(1000)})
factor = pd.cut(frame.data1,4)
factor[:10]

0     (0.117, 1.592]
1    (-1.358, 0.117]
2     (0.117, 1.592]
3    (-1.358, 0.117]
4    (-1.358, 0.117]
5    (-1.358, 0.117]
6    (-1.358, 0.117]
7    (-1.358, 0.117]
8     (1.592, 3.067]
9     (0.117, 1.592]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.839, -1.358] < (-1.358, 0.117] < (0.117, 1.592] < (1.592, 3.067]]

In [82]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),
           'count':group.count(),'mean':group.mean()}
grouped = frame.data2.groupby(factor)
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-2.839, -1.358] -4.062342  2.480411   87.0  0.076473
(-1.358, 0.117]  -3.698811  3.063225  447.0  0.053934
(0.117, 1.592]   -2.775532  3.120921  416.0 -0.036276
(1.592, 3.067]   -3.132569  3.281067   50.0  0.368718

In [83]:
grouping = pd.qcut(frame.data1,10,labels=False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -4.062342  2.480411  100.0  0.075699
1     -2.564526  3.063225  100.0  0.002790
2     -3.698811  2.879565  100.0 -0.041795
3     -2.184109  2.671373  100.0  0.078710
4     -3.490256  2.304778  100.0  0.177310
5     -2.494869  2.450062  100.0  0.040265
6     -2.370139  2.418733  100.0 -0.029631
7     -2.109251  2.233492  100.0 -0.095448
8     -2.759277  3.120921  100.0  0.068630
9     -3.132569  3.281067  100.0  0.064535

In [84]:
'''
示例：用特定于分组的值填充缺失值
'''
s=Series(np.random.randn(6))
s[::2]=np.nan
s

0         NaN
1   -0.352214
2         NaN
3   -0.386382
4         NaN
5   -0.615389
dtype: float64

In [85]:
s.fillna(s.mean())

0   -0.451329
1   -0.352214
2   -0.451329
3   -0.386382
4   -0.451329
5   -0.615389
dtype: float64

In [87]:
states = ['Ohio','New York','Vermont','Florida','Oregon','Nevada','California','Idaho']
group_key = ['East']*4+['West']*4
data = Series(np.random.randn(8),index = states)
data[['Vermont','Nevada','Idaho']]=np.nan
data

Ohio          0.481574
New York      0.215368
Vermont            NaN
Florida       0.725500
Oregon       -0.731588
Nevada             NaN
California    0.682832
Idaho              NaN
dtype: float64

In [88]:
data.groupby(group_key).mean()

East    0.474147
West   -0.024378
dtype: float64

In [89]:
fill_mean=lambda g:g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio          0.481574
New York      0.215368
Vermont       0.474147
Florida       0.725500
Oregon       -0.731588
Nevada       -0.024378
California    0.682832
Idaho        -0.024378
dtype: float64

In [90]:
fill_values = {'East':0.5,'West':-1}
fill_func=lambda g:g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

Ohio          0.481574
New York      0.215368
Vermont       0.500000
Florida       0.725500
Oregon       -0.731588
Nevada       -1.000000
California    0.682832
Idaho        -1.000000
dtype: float64

In [96]:
'''
交叉表crosstab
'''
pd.crosstab(data.Gender, data.Handedness,margins=True)

AttributeError: 'Series' object has no attribute 'Gender'